Tekla Open API Reference for Tekla Structures 2025
Name Methods
The ComponentFilterExpressions.Name type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
ComponentFilterExpressions.Name Class
Tekla.Structures.Filtering.Categories Namespace